package unit_test.lesson5.hw5;

/**
 * *Задание 1. *Представьте, что вы работаете над разработкой простого приложения для записной книжки, которое
 * позволяет пользователям добавлять, редактировать и удалять контакты.
 * Ваша задача - придумать как можно больше различных тестов (юнит-тесты, интеграционные тесты, сквозные тесты) для
 * этого приложения. Напишите название каждого теста, его тип и краткое описание того, что этот тест проверяет.
 * <p>
 * *Задание 2. *Ниже список тестовых сценариев. Ваша задача - определить тип каждого теста (юнит-тест, интеграционный
 * тест, сквозной тест) и объяснить, почему вы так решили.
 * Проверка того, что функция addContact корректно добавляет новый контакт в список контактов"".
 * ""Проверка того, что при добавлении контакта через пользовательский интерфейс, контакт корректно отображается в
 * списке контактов"".
 * ""Проверка полного цикла работы с контактом: создание контакта, его редактирование и последующее удаление"".
 */
public class ContactApp {

    public static void main(String[] args) {
        ContactBook contactBook = new ContactBook();

    }
}
