## Урок 1. Знакомство с языком программирования Java

Вычислить n-ое треугольного число(сумма чисел от 1 до n), n! (произведение чисел от 1 до n)

Вывести все простые числа от 1 до 1000

Реализовать простой калькулятор

* +Задано уравнение вида q + w = e, q, w, e >= 0. Некоторые цифры могут быть заменены знаком вопроса, например 2? + ?5 = 69. Требуется восстановить выражение до верного равенства. Предложить хотя бы одно решение или сообщить, что его нет.
## Урок 2. Почему вы не можете не использовать API
Всем привет! вот список задач на домашнее закрепление:
1) Дана последовательность N целых чисел. Найти сумму простых чисел.
2) Дана последовательность из N целых чисел. Верно ли, что последовательность является возрастающей.
3) Дан массив целых чисел. Заменить отрицательные элементы на сумму индексов двузначных элементов массива.
   4)() Отвалидировать доску судоку
   /Требования
   Объявлена доска 9 x 9 необходимо отвалидировать в соответствии с правилами
1. Каждая строка должна содержать цифру 1-9 без повторения
2. Каждая колонка должна содержать цифру 1-9 без повторения
3. Каждый под блок из 9 элементов 3 x 3 должна содержать цифру 1-9 без повторения
   Ограничения
   • board.length == 9
   • board[i].length == 9
   • board[i][j] значение число или '.'
   */
   public class Main {
   public static void main(String[] args) {
   char[][] board = {
   {'5', '3', '.', '.', '7', '.', '.', '.', '.'},
   {'6', '.', '.', '1', '9', '5', '.', '.', '.'},
   {'.', '9', '8', '.', '.', '.', '.', '6', '.'},
   {'8', '.', '.', '.', '6', '.', '.', '.', '3'},
   {'4', '.', '.', '8', '.', '3', '.', '.', '1'},
   {'7', '.', '.', '.', '2', '.', '.', '.', '6'},
   {'.', '6', '.', '.', '.', '.', '2', '8', '.'},
   {'.', '.', '.', '4', '1', '9', '.', '.', '5'},
   {'.', '.', '.', '.', '8', '.', '.', '7', '9'}};

   System.out.println("Validete:" + isValidSudoku(board));  }
## Урок 3. Коллекции JAVA: Введение
Всем привет, вот список задач на домашнее закрепление.
1. Дан массив записей: наименование товара, цена, сорт. Найти наибольшую цену товаров 1го или 2го сорта среди товаров, название которых содержит «высший».
2. Сведения о товаре состоят из наименования, страны-производителя, веса, цены, сорта. Получить наименования товаров заданного сорта с наименьшей ценой.
3. Сведения о книге состоят из названия, фамилии автора, цены, года издания и количества страниц. Найти названия книг, в которых простое количество страниц, фамилия автора содержит «А» и год издания после 2010 г, включительно.
4. Задан целочисленный список ArrayList. Найти минимальное, максимальное и среднее из этого списка.
   5*) при входном массиве, вернуть массив массивов со всеми перестановками его элементов. (со звездочкой)
   Пример входных данных:
   [1,2,3]
   Пример выходных данных:
   [[1,2,3],[1,3,2],[2,1,3],[2,3,1],[3,1,2],[3,2,1]]
## Урок 4. Хранение и обработка данных ч1: приоритетные коллекции
ДЗ:
1)Вывести список на экран в перевернутом виде (без массивов и ArrayList)
Пример:
1 -> 2->3->4
Вывод:
4->3->2->1
## Урок 5. Хранение и обработка данных ч2: множество коллекций Map
Дз на закрепление :
1) Подсчитать количество искомого слова, через map (наполнением значение, где искомое слово будет являться ключом), вносить все слова не нужно
   Пример:
   Россия идет вперед всей планеты. Планета — это не Россия.
   Запрос: Россия
   Ответ: Россия - 2
   toLoverCase().
   (Усложнение - игнорировать пунктуацию)*
2) Пусть дан список сотрудников:

Иван Иванов

Светлана Петрова

Кристина Белова

Анна Мусина

Анна Крутова

Иван Юрин

Петр Лыков

Павел Чернов

Петр Чернышов

Мария Федорова

Марина Светлова

Мария Савина

Мария Рыкова

Марина Лугова

Анна Владимирова

Иван Мечников

Петр Петин

Иван Ежов

Написать программу, которая найдёт и выведет повторяющиеся имена с количеством повторений. Отсортировать по убыванию популярности.
## Урок 6. Хранение и обработка данных ч3: множество коллекций Set
Задание на дом :
• Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
• Создать множество ноутбуков.
• Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки, отвечающие фильтру. Критерии фильтрации можно хранить в Map. Например:
“Введите цифру, соответствующую необходимому критерию:
1 - ОЗУ
2 - Объем ЖД
3 - Операционная система
4 - Цвет …
• Далее нужно запросить минимальные значения для указанных критериев - сохранить параметры фильтрации можно также в Map.
• Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям.